app/views/todos/new.haml

SELECT "priorities".* FROM "priorities"
---
      .form__priority
        = f.collection_select(:priority_id, Priority.all, :id, :name, class: "collection_select")
      .form_title

SELECT "statuses"."id" FROM "statuses"
---
      .form__status
        = f.collection_select(:status_id, Status.all, :id, :name, class: "collection_select")
      .form__send