app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT "todos"."id" FROM "todos"

  def create
    @todo = Todo.new(todo_params)
    @todo.user = current_user

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("created_at", "updated_at", "task", "detail", "deadline") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-03-08 06:12:38.820407"], ["updated_at", "2018-03-08 06:12:38.820407"], ["task", "じゃーじゃービンクスに会う"], ["detail", "明日の午後じゃじゃーと面会"], ["deadline", "2018-03-09 00:00:00"]]